[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:101:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.explanation && "Explanation is required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Explanation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:115:27
               type="datetime-local"
               isInvalid={Boolean(errors.dateRequested)}
               {...register("dateRequested", {
-                required: "Date Requested is required.",
+                required: "",
               })}
             />
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Requested is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:133:27
               type="datetime-local"
               isInvalid={Boolean(errors.dateNeeded)}
               {...register("dateNeeded", {
-                required: "Date Needed is required.",
+                required: "",
               })}
             />
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Needed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:151:27
               type="text"
               isInvalid={Boolean(errors.done)}
               {...register("done", {
-                required: true,
+                required: false,
               })}
             />
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Done is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:155:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.done && "Done is required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Done is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:155:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.done && "Done is required. "}
+              {errors.done || "Done is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Done/

Here are the matching elements:

Ignored nodes: comments, script, style
<label
  class="form-label"
  for="done"
