[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestEditPage.js:44:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `RecommendationRequest Updated - id: ${recommendationRequest.id} requester: ${recommendationRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />
