[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:60:11
     },
     {
       Header: "Done",
-      id: "done",
+      id: "",
       Cell: ({ cell }) => cell.row.original.done.toString(),
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-done"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:61:13
     {
       Header: "Done",
       id: "done",
-      Cell: ({ cell }) => cell.row.original.done.toString(),
+      Cell: () => undefined,
     },
   ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:
