[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:20:24
 
   const navigate = useNavigate();
 
-  const testIdPrefix = "OrganizationForm";
+  const testIdPrefix = "";
 
   return (
killedBy: OrganizationForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="OrganizationForm-inactive"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:69:24
           isInvalid={Boolean(errors.orgTranslationShort)}
           {...register("orgTranslationShort", {
             required: "Organization Translation Short is required.",
-            maxLength: {
-              value: 30,
-              message: "Max length for the short translation is 30 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: OrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length for the short translation is 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
